Public Attributes | List of all members
API_IFCEntityDescriptor Struct Reference
IFC
Contains IFC Global ID and Archicad ID of an IFC Entity. More...
#include <APIdefs_IFC.h>
 Public Attributes
 API_Guid  | ifcGlobalId
IFC Global ID.
 API_Guid  | elementID
Archicad ID.
Detailed Description
Contains IFC Global ID and Archicad ID of an IFC Entity.